CSI API ETABS v1
cLoadPatterns.SetLoadType Method
 Assigns a load type to a load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadType(
	string Name,
	eLoadPatternType MyType
)
Function SetLoadType (
	Name As String,
	MyType As eLoadPatternType
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim MyType As eLoadPatternType
Dim returnValue As Integer
returnValue = instance.SetLoadType(Name,
	MyType)
int SetLoadType(
	String^ Name,
	eLoadPatternType MyType
)
abstract SetLoadType :
        Name : string *
        MyType : eLoadPatternType -> int
Parameters
Name
Type: System.String
 The name of an existing load pattern.
MyType
Type: ETABSv1.eLoadPatternType
 This is one of the items in the eLoadPatternType enumeration.
Return Value
Type: Int32
 Returns zero if the load type is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyType As eLoadPatternType
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign load type
       ret = SapModel.LoadPatterns.SetLoadType("DEAD", eLoadPatternType.SuperDead)
   'get load pattern type
       ret = SapModel.LoadPatterns.GetLoadType("DEAD", MyType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace